program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.5.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.3.0"}})]
{
    func main<ios16>(tensor<int32, [1, 512]> attention_mask, tensor<int32, [1, 512]> input_ids) {
            tensor<int32, []> word_embeds_axis_0 = const()[name = tensor<string, []>("word_embeds_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> word_embeds_batch_dims_0 = const()[name = tensor<string, []>("word_embeds_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [30522, 384]> embeddings_word_embeddings_weight_to_fp16 = const()[name = tensor<string, []>("embeddings_word_embeddings_weight_to_fp16"), val = tensor<fp16, [30522, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, 512, 384]> word_embeds_cast_fp16 = gather(axis = word_embeds_axis_0, batch_dims = word_embeds_batch_dims_0, indices = input_ids, x = embeddings_word_embeddings_weight_to_fp16)[name = tensor<string, []>("word_embeds_cast_fp16")];
            tensor<fp16, [1, 512, 384]> position_embeds_to_fp16 = const()[name = tensor<string, []>("position_embeds_to_fp16"), val = tensor<fp16, [1, 512, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23441024)))];
            tensor<fp16, [1, 512, 384]> var_77_cast_fp16 = add(x = word_embeds_cast_fp16, y = position_embeds_to_fp16)[name = tensor<string, []>("op_77_cast_fp16")];
            tensor<fp16, [1, 512, 384]> token_type_embeds_to_fp16 = const()[name = tensor<string, []>("token_type_embeds_to_fp16"), val = tensor<fp16, [1, 512, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23834304)))];
            tensor<fp16, [1, 512, 384]> input_5_cast_fp16 = add(x = var_77_cast_fp16, y = token_type_embeds_to_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = tensor<string, []>("input_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> embeddings_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("embeddings_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24227584)))];
            tensor<fp16, [384]> embeddings_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("embeddings_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24228416)))];
            tensor<fp16, []> var_81_to_fp16 = const()[name = tensor<string, []>("op_81_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 512, 384]> input_7_cast_fp16 = layer_norm(axes = input_7_axes_0, beta = embeddings_LayerNorm_bias_to_fp16, epsilon = var_81_to_fp16, gamma = embeddings_LayerNorm_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [1]> var_91_axes_0 = const()[name = tensor<string, []>("op_91_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1, 1, 512]> var_91 = expand_dims(axes = var_91_axes_0, x = attention_mask)[name = tensor<string, []>("op_91")];
            tensor<int32, [1]> var_93_axes_0 = const()[name = tensor<string, []>("op_93_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1, 1, 1, 512]> var_93 = expand_dims(axes = var_93_axes_0, x = var_91)[name = tensor<string, []>("op_93")];
            tensor<fp16, []> var_99_to_fp16 = const()[name = tensor<string, []>("op_99_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<string, []> cast_3_to_fp16_dtype_0 = const()[name = tensor<string, []>("cast_3_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 1, 1, 512]> var_93_to_fp16 = cast(dtype = cast_3_to_fp16_dtype_0, x = var_93)[name = tensor<string, []>("cast_79")];
            tensor<fp16, [1, 1, 1, 512]> var_101_cast_fp16 = sub(x = var_99_to_fp16, y = var_93_to_fp16)[name = tensor<string, []>("op_101_cast_fp16")];
            tensor<fp16, []> var_102_to_fp16 = const()[name = tensor<string, []>("op_102_to_fp16"), val = tensor<fp16, []>(-0x1.388p+13)];
            tensor<fp16, [1, 1, 1, 512]> attention_mask_cast_fp16 = mul(x = var_101_cast_fp16, y = var_102_to_fp16)[name = tensor<string, []>("attention_mask_cast_fp16")];
            tensor<int32, []> var_110 = const()[name = tensor<string, []>("op_110"), val = tensor<int32, []>(-1)];
            tensor<fp16, [384, 384]> encoder_layer_0_attention_self_query_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_self_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24229248)))];
            tensor<fp16, [384]> encoder_layer_0_attention_self_query_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_self_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24524224)))];
            tensor<fp16, [1, 512, 384]> linear_0_cast_fp16 = linear(bias = encoder_layer_0_attention_self_query_bias_to_fp16, weight = encoder_layer_0_attention_self_query_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [384, 384]> encoder_layer_0_attention_self_key_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_self_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24525056)))];
            tensor<fp16, [384]> encoder_layer_0_attention_self_key_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_self_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24820032)))];
            tensor<fp16, [1, 512, 384]> linear_1_cast_fp16 = linear(bias = encoder_layer_0_attention_self_key_bias_to_fp16, weight = encoder_layer_0_attention_self_key_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<int32, [4]> var_135 = const()[name = tensor<string, []>("op_135"), val = tensor<int32, [4]>([1, 512, 12, 32])];
            tensor<fp16, [1, 512, 12, 32]> x_3_cast_fp16 = reshape(shape = var_135, x = linear_1_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<fp16, [384, 384]> encoder_layer_0_attention_self_value_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_self_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24820864)))];
            tensor<fp16, [384]> encoder_layer_0_attention_self_value_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_self_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25115840)))];
            tensor<fp16, [1, 512, 384]> linear_2_cast_fp16 = linear(bias = encoder_layer_0_attention_self_value_bias_to_fp16, weight = encoder_layer_0_attention_self_value_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [4]> var_144 = const()[name = tensor<string, []>("op_144"), val = tensor<int32, [4]>([1, 512, 12, 32])];
            tensor<fp16, [1, 512, 12, 32]> x_7_cast_fp16 = reshape(shape = var_144, x = linear_2_cast_fp16)[name = tensor<string, []>("x_7_cast_fp16")];
            tensor<int32, [4]> var_146 = const()[name = tensor<string, []>("op_146"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_150 = const()[name = tensor<string, []>("op_150"), val = tensor<int32, [4]>([1, 512, 12, 32])];
            tensor<fp16, [1, 512, 12, 32]> x_11_cast_fp16 = reshape(shape = var_150, x = linear_0_cast_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<bool, []> attention_scores_1_transpose_x_0 = const()[name = tensor<string, []>("attention_scores_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attention_scores_1_transpose_y_0 = const()[name = tensor<string, []>("attention_scores_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_36_perm_0 = const()[name = tensor<string, []>("transpose_36_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_37_perm_0 = const()[name = tensor<string, []>("transpose_37_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 12, 32, 512]> transpose_37 = transpose(perm = transpose_37_perm_0, x = x_3_cast_fp16)[name = tensor<string, []>("transpose_105")];
            tensor<fp16, [1, 12, 512, 32]> transpose_36 = transpose(perm = transpose_36_perm_0, x = x_11_cast_fp16)[name = tensor<string, []>("transpose_106")];
            tensor<fp16, [1, 12, 512, 512]> attention_scores_1_cast_fp16 = matmul(transpose_x = attention_scores_1_transpose_x_0, transpose_y = attention_scores_1_transpose_y_0, x = transpose_36, y = transpose_37)[name = tensor<string, []>("attention_scores_1_cast_fp16")];
            tensor<fp16, []> _inversed_attention_scores_3_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_attention_scores_3_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [1, 12, 512, 512]> _inversed_attention_scores_3_cast_fp16 = mul(x = attention_scores_1_cast_fp16, y = _inversed_attention_scores_3_y_0_to_fp16)[name = tensor<string, []>("_inversed_attention_scores_3_cast_fp16")];
            tensor<fp16, [1, 12, 512, 512]> input_11_cast_fp16 = add(x = _inversed_attention_scores_3_cast_fp16, y = attention_mask_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [1, 12, 512, 512]> input_13_cast_fp16 = softmax(axis = var_110, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<bool, []> context_layer_1_transpose_x_0 = const()[name = tensor<string, []>("context_layer_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> context_layer_1_transpose_y_0 = const()[name = tensor<string, []>("context_layer_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 512, 32]> value_layer_1_cast_fp16 = transpose(perm = var_146, x = x_7_cast_fp16)[name = tensor<string, []>("transpose_107")];
            tensor<fp16, [1, 12, 512, 32]> context_layer_1_cast_fp16 = matmul(transpose_x = context_layer_1_transpose_x_0, transpose_y = context_layer_1_transpose_y_0, x = input_13_cast_fp16, y = value_layer_1_cast_fp16)[name = tensor<string, []>("context_layer_1_cast_fp16")];
            tensor<int32, [4]> var_162 = const()[name = tensor<string, []>("op_162"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_167 = const()[name = tensor<string, []>("op_167"), val = tensor<int32, [3]>([1, 512, 384])];
            tensor<fp16, [1, 512, 12, 32]> var_163_cast_fp16 = transpose(perm = var_162, x = context_layer_1_cast_fp16)[name = tensor<string, []>("transpose_104")];
            tensor<fp16, [1, 512, 384]> input_15_cast_fp16 = reshape(shape = var_167, x = var_163_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [384, 384]> encoder_layer_0_attention_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25116672)))];
            tensor<fp16, [384]> encoder_layer_0_attention_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25411648)))];
            tensor<fp16, [1, 512, 384]> linear_3_cast_fp16 = linear(bias = encoder_layer_0_attention_output_dense_bias_to_fp16, weight = encoder_layer_0_attention_output_dense_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, 512, 384]> input_19_cast_fp16 = add(x = linear_3_cast_fp16, y = input_7_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<int32, [1]> input_21_axes_0 = const()[name = tensor<string, []>("input_21_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> encoder_layer_0_attention_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25412480)))];
            tensor<fp16, [384]> encoder_layer_0_attention_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25413312)))];
            tensor<fp16, []> var_117_to_fp16 = const()[name = tensor<string, []>("op_117_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 512, 384]> input_21_cast_fp16 = layer_norm(axes = input_21_axes_0, beta = encoder_layer_0_attention_output_LayerNorm_bias_to_fp16, epsilon = var_117_to_fp16, gamma = encoder_layer_0_attention_output_LayerNorm_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [1536, 384]> encoder_layer_0_intermediate_dense_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_intermediate_dense_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25414144)))];
            tensor<fp16, [1536]> encoder_layer_0_intermediate_dense_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26593856)))];
            tensor<fp16, [1, 512, 1536]> linear_4_cast_fp16 = linear(bias = encoder_layer_0_intermediate_dense_bias_to_fp16, weight = encoder_layer_0_intermediate_dense_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<string, []> input_25_mode_0 = const()[name = tensor<string, []>("input_25_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 1536]> input_25_cast_fp16 = gelu(mode = input_25_mode_0, x = linear_4_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [384, 1536]> encoder_layer_0_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26596992)))];
            tensor<fp16, [384]> encoder_layer_0_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27776704)))];
            tensor<fp16, [1, 512, 384]> linear_5_cast_fp16 = linear(bias = encoder_layer_0_output_dense_bias_to_fp16, weight = encoder_layer_0_output_dense_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [1, 512, 384]> input_29_cast_fp16 = add(x = linear_5_cast_fp16, y = input_21_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<int32, [1]> input_31_axes_0 = const()[name = tensor<string, []>("input_31_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> encoder_layer_0_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27777536)))];
            tensor<fp16, [384]> encoder_layer_0_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27778368)))];
            tensor<fp16, [1, 512, 384]> input_31_cast_fp16 = layer_norm(axes = input_31_axes_0, beta = encoder_layer_0_output_LayerNorm_bias_to_fp16, epsilon = var_117_to_fp16, gamma = encoder_layer_0_output_LayerNorm_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<int32, []> var_202 = const()[name = tensor<string, []>("op_202"), val = tensor<int32, []>(-1)];
            tensor<fp16, [384, 384]> encoder_layer_1_attention_self_query_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_self_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27779200)))];
            tensor<fp16, [384]> encoder_layer_1_attention_self_query_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_self_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28074176)))];
            tensor<fp16, [1, 512, 384]> linear_6_cast_fp16 = linear(bias = encoder_layer_1_attention_self_query_bias_to_fp16, weight = encoder_layer_1_attention_self_query_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<fp16, [384, 384]> encoder_layer_1_attention_self_key_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_self_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28075008)))];
            tensor<fp16, [384]> encoder_layer_1_attention_self_key_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_self_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28369984)))];
            tensor<fp16, [1, 512, 384]> linear_7_cast_fp16 = linear(bias = encoder_layer_1_attention_self_key_bias_to_fp16, weight = encoder_layer_1_attention_self_key_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<int32, [4]> var_227 = const()[name = tensor<string, []>("op_227"), val = tensor<int32, [4]>([1, 512, 12, 32])];
            tensor<fp16, [1, 512, 12, 32]> x_15_cast_fp16 = reshape(shape = var_227, x = linear_7_cast_fp16)[name = tensor<string, []>("x_15_cast_fp16")];
            tensor<fp16, [384, 384]> encoder_layer_1_attention_self_value_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_self_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28370816)))];
            tensor<fp16, [384]> encoder_layer_1_attention_self_value_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_self_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28665792)))];
            tensor<fp16, [1, 512, 384]> linear_8_cast_fp16 = linear(bias = encoder_layer_1_attention_self_value_bias_to_fp16, weight = encoder_layer_1_attention_self_value_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<int32, [4]> var_236 = const()[name = tensor<string, []>("op_236"), val = tensor<int32, [4]>([1, 512, 12, 32])];
            tensor<fp16, [1, 512, 12, 32]> x_19_cast_fp16 = reshape(shape = var_236, x = linear_8_cast_fp16)[name = tensor<string, []>("x_19_cast_fp16")];
            tensor<int32, [4]> var_238 = const()[name = tensor<string, []>("op_238"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_242 = const()[name = tensor<string, []>("op_242"), val = tensor<int32, [4]>([1, 512, 12, 32])];
            tensor<fp16, [1, 512, 12, 32]> x_23_cast_fp16 = reshape(shape = var_242, x = linear_6_cast_fp16)[name = tensor<string, []>("x_23_cast_fp16")];
            tensor<bool, []> attention_scores_5_transpose_x_0 = const()[name = tensor<string, []>("attention_scores_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attention_scores_5_transpose_y_0 = const()[name = tensor<string, []>("attention_scores_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_38_perm_0 = const()[name = tensor<string, []>("transpose_38_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_39_perm_0 = const()[name = tensor<string, []>("transpose_39_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 12, 32, 512]> transpose_39 = transpose(perm = transpose_39_perm_0, x = x_15_cast_fp16)[name = tensor<string, []>("transpose_101")];
            tensor<fp16, [1, 12, 512, 32]> transpose_38 = transpose(perm = transpose_38_perm_0, x = x_23_cast_fp16)[name = tensor<string, []>("transpose_102")];
            tensor<fp16, [1, 12, 512, 512]> attention_scores_5_cast_fp16 = matmul(transpose_x = attention_scores_5_transpose_x_0, transpose_y = attention_scores_5_transpose_y_0, x = transpose_38, y = transpose_39)[name = tensor<string, []>("attention_scores_5_cast_fp16")];
            tensor<fp16, []> _inversed_attention_scores_7_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_attention_scores_7_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [1, 12, 512, 512]> _inversed_attention_scores_7_cast_fp16 = mul(x = attention_scores_5_cast_fp16, y = _inversed_attention_scores_7_y_0_to_fp16)[name = tensor<string, []>("_inversed_attention_scores_7_cast_fp16")];
            tensor<fp16, [1, 12, 512, 512]> input_33_cast_fp16 = add(x = _inversed_attention_scores_7_cast_fp16, y = attention_mask_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<fp16, [1, 12, 512, 512]> input_35_cast_fp16 = softmax(axis = var_202, x = input_33_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<bool, []> context_layer_5_transpose_x_0 = const()[name = tensor<string, []>("context_layer_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> context_layer_5_transpose_y_0 = const()[name = tensor<string, []>("context_layer_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 512, 32]> value_layer_3_cast_fp16 = transpose(perm = var_238, x = x_19_cast_fp16)[name = tensor<string, []>("transpose_103")];
            tensor<fp16, [1, 12, 512, 32]> context_layer_5_cast_fp16 = matmul(transpose_x = context_layer_5_transpose_x_0, transpose_y = context_layer_5_transpose_y_0, x = input_35_cast_fp16, y = value_layer_3_cast_fp16)[name = tensor<string, []>("context_layer_5_cast_fp16")];
            tensor<int32, [4]> var_254 = const()[name = tensor<string, []>("op_254"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_259 = const()[name = tensor<string, []>("op_259"), val = tensor<int32, [3]>([1, 512, 384])];
            tensor<fp16, [1, 512, 12, 32]> var_255_cast_fp16 = transpose(perm = var_254, x = context_layer_5_cast_fp16)[name = tensor<string, []>("transpose_100")];
            tensor<fp16, [1, 512, 384]> input_37_cast_fp16 = reshape(shape = var_259, x = var_255_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [384, 384]> encoder_layer_1_attention_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28666624)))];
            tensor<fp16, [384]> encoder_layer_1_attention_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28961600)))];
            tensor<fp16, [1, 512, 384]> linear_9_cast_fp16 = linear(bias = encoder_layer_1_attention_output_dense_bias_to_fp16, weight = encoder_layer_1_attention_output_dense_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [1, 512, 384]> input_41_cast_fp16 = add(x = linear_9_cast_fp16, y = input_31_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<int32, [1]> input_43_axes_0 = const()[name = tensor<string, []>("input_43_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> encoder_layer_1_attention_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28962432)))];
            tensor<fp16, [384]> encoder_layer_1_attention_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28963264)))];
            tensor<fp16, []> var_209_to_fp16 = const()[name = tensor<string, []>("op_209_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 512, 384]> input_43_cast_fp16 = layer_norm(axes = input_43_axes_0, beta = encoder_layer_1_attention_output_LayerNorm_bias_to_fp16, epsilon = var_209_to_fp16, gamma = encoder_layer_1_attention_output_LayerNorm_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<fp16, [1536, 384]> encoder_layer_1_intermediate_dense_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_intermediate_dense_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28964096)))];
            tensor<fp16, [1536]> encoder_layer_1_intermediate_dense_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30143808)))];
            tensor<fp16, [1, 512, 1536]> linear_10_cast_fp16 = linear(bias = encoder_layer_1_intermediate_dense_bias_to_fp16, weight = encoder_layer_1_intermediate_dense_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<string, []> input_47_mode_0 = const()[name = tensor<string, []>("input_47_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 1536]> input_47_cast_fp16 = gelu(mode = input_47_mode_0, x = linear_10_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<fp16, [384, 1536]> encoder_layer_1_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30146944)))];
            tensor<fp16, [384]> encoder_layer_1_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31326656)))];
            tensor<fp16, [1, 512, 384]> linear_11_cast_fp16 = linear(bias = encoder_layer_1_output_dense_bias_to_fp16, weight = encoder_layer_1_output_dense_weight_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [1, 512, 384]> input_51_cast_fp16 = add(x = linear_11_cast_fp16, y = input_43_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<int32, [1]> input_53_axes_0 = const()[name = tensor<string, []>("input_53_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> encoder_layer_1_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31327488)))];
            tensor<fp16, [384]> encoder_layer_1_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31328320)))];
            tensor<fp16, [1, 512, 384]> input_53_cast_fp16 = layer_norm(axes = input_53_axes_0, beta = encoder_layer_1_output_LayerNorm_bias_to_fp16, epsilon = var_209_to_fp16, gamma = encoder_layer_1_output_LayerNorm_weight_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<int32, []> var_294 = const()[name = tensor<string, []>("op_294"), val = tensor<int32, []>(-1)];
            tensor<fp16, [384, 384]> encoder_layer_2_attention_self_query_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_self_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31329152)))];
            tensor<fp16, [384]> encoder_layer_2_attention_self_query_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_self_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31624128)))];
            tensor<fp16, [1, 512, 384]> linear_12_cast_fp16 = linear(bias = encoder_layer_2_attention_self_query_bias_to_fp16, weight = encoder_layer_2_attention_self_query_weight_to_fp16, x = input_53_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<fp16, [384, 384]> encoder_layer_2_attention_self_key_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_self_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31624960)))];
            tensor<fp16, [384]> encoder_layer_2_attention_self_key_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_self_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31919936)))];
            tensor<fp16, [1, 512, 384]> linear_13_cast_fp16 = linear(bias = encoder_layer_2_attention_self_key_bias_to_fp16, weight = encoder_layer_2_attention_self_key_weight_to_fp16, x = input_53_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<int32, [4]> var_319 = const()[name = tensor<string, []>("op_319"), val = tensor<int32, [4]>([1, 512, 12, 32])];
            tensor<fp16, [1, 512, 12, 32]> x_27_cast_fp16 = reshape(shape = var_319, x = linear_13_cast_fp16)[name = tensor<string, []>("x_27_cast_fp16")];
            tensor<fp16, [384, 384]> encoder_layer_2_attention_self_value_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_self_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31920768)))];
            tensor<fp16, [384]> encoder_layer_2_attention_self_value_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_self_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32215744)))];
            tensor<fp16, [1, 512, 384]> linear_14_cast_fp16 = linear(bias = encoder_layer_2_attention_self_value_bias_to_fp16, weight = encoder_layer_2_attention_self_value_weight_to_fp16, x = input_53_cast_fp16)[name = tensor<string, []>("linear_14_cast_fp16")];
            tensor<int32, [4]> var_328 = const()[name = tensor<string, []>("op_328"), val = tensor<int32, [4]>([1, 512, 12, 32])];
            tensor<fp16, [1, 512, 12, 32]> x_31_cast_fp16 = reshape(shape = var_328, x = linear_14_cast_fp16)[name = tensor<string, []>("x_31_cast_fp16")];
            tensor<int32, [4]> var_330 = const()[name = tensor<string, []>("op_330"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_334 = const()[name = tensor<string, []>("op_334"), val = tensor<int32, [4]>([1, 512, 12, 32])];
            tensor<fp16, [1, 512, 12, 32]> x_35_cast_fp16 = reshape(shape = var_334, x = linear_12_cast_fp16)[name = tensor<string, []>("x_35_cast_fp16")];
            tensor<bool, []> attention_scores_9_transpose_x_0 = const()[name = tensor<string, []>("attention_scores_9_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attention_scores_9_transpose_y_0 = const()[name = tensor<string, []>("attention_scores_9_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_40_perm_0 = const()[name = tensor<string, []>("transpose_40_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_41_perm_0 = const()[name = tensor<string, []>("transpose_41_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 12, 32, 512]> transpose_41 = transpose(perm = transpose_41_perm_0, x = x_27_cast_fp16)[name = tensor<string, []>("transpose_97")];
            tensor<fp16, [1, 12, 512, 32]> transpose_40 = transpose(perm = transpose_40_perm_0, x = x_35_cast_fp16)[name = tensor<string, []>("transpose_98")];
            tensor<fp16, [1, 12, 512, 512]> attention_scores_9_cast_fp16 = matmul(transpose_x = attention_scores_9_transpose_x_0, transpose_y = attention_scores_9_transpose_y_0, x = transpose_40, y = transpose_41)[name = tensor<string, []>("attention_scores_9_cast_fp16")];
            tensor<fp16, []> _inversed_attention_scores_11_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_attention_scores_11_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [1, 12, 512, 512]> _inversed_attention_scores_11_cast_fp16 = mul(x = attention_scores_9_cast_fp16, y = _inversed_attention_scores_11_y_0_to_fp16)[name = tensor<string, []>("_inversed_attention_scores_11_cast_fp16")];
            tensor<fp16, [1, 12, 512, 512]> input_55_cast_fp16 = add(x = _inversed_attention_scores_11_cast_fp16, y = attention_mask_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<fp16, [1, 12, 512, 512]> input_57_cast_fp16 = softmax(axis = var_294, x = input_55_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<bool, []> context_layer_9_transpose_x_0 = const()[name = tensor<string, []>("context_layer_9_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> context_layer_9_transpose_y_0 = const()[name = tensor<string, []>("context_layer_9_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 512, 32]> value_layer_5_cast_fp16 = transpose(perm = var_330, x = x_31_cast_fp16)[name = tensor<string, []>("transpose_99")];
            tensor<fp16, [1, 12, 512, 32]> context_layer_9_cast_fp16 = matmul(transpose_x = context_layer_9_transpose_x_0, transpose_y = context_layer_9_transpose_y_0, x = input_57_cast_fp16, y = value_layer_5_cast_fp16)[name = tensor<string, []>("context_layer_9_cast_fp16")];
            tensor<int32, [4]> var_346 = const()[name = tensor<string, []>("op_346"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_351 = const()[name = tensor<string, []>("op_351"), val = tensor<int32, [3]>([1, 512, 384])];
            tensor<fp16, [1, 512, 12, 32]> var_347_cast_fp16 = transpose(perm = var_346, x = context_layer_9_cast_fp16)[name = tensor<string, []>("transpose_96")];
            tensor<fp16, [1, 512, 384]> input_59_cast_fp16 = reshape(shape = var_351, x = var_347_cast_fp16)[name = tensor<string, []>("input_59_cast_fp16")];
            tensor<fp16, [384, 384]> encoder_layer_2_attention_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32216576)))];
            tensor<fp16, [384]> encoder_layer_2_attention_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32511552)))];
            tensor<fp16, [1, 512, 384]> linear_15_cast_fp16 = linear(bias = encoder_layer_2_attention_output_dense_bias_to_fp16, weight = encoder_layer_2_attention_output_dense_weight_to_fp16, x = input_59_cast_fp16)[name = tensor<string, []>("linear_15_cast_fp16")];
            tensor<fp16, [1, 512, 384]> input_63_cast_fp16 = add(x = linear_15_cast_fp16, y = input_53_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<int32, [1]> input_65_axes_0 = const()[name = tensor<string, []>("input_65_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> encoder_layer_2_attention_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32512384)))];
            tensor<fp16, [384]> encoder_layer_2_attention_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32513216)))];
            tensor<fp16, []> var_301_to_fp16 = const()[name = tensor<string, []>("op_301_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 512, 384]> input_65_cast_fp16 = layer_norm(axes = input_65_axes_0, beta = encoder_layer_2_attention_output_LayerNorm_bias_to_fp16, epsilon = var_301_to_fp16, gamma = encoder_layer_2_attention_output_LayerNorm_weight_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<fp16, [1536, 384]> encoder_layer_2_intermediate_dense_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_intermediate_dense_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32514048)))];
            tensor<fp16, [1536]> encoder_layer_2_intermediate_dense_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33693760)))];
            tensor<fp16, [1, 512, 1536]> linear_16_cast_fp16 = linear(bias = encoder_layer_2_intermediate_dense_bias_to_fp16, weight = encoder_layer_2_intermediate_dense_weight_to_fp16, x = input_65_cast_fp16)[name = tensor<string, []>("linear_16_cast_fp16")];
            tensor<string, []> input_69_mode_0 = const()[name = tensor<string, []>("input_69_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 1536]> input_69_cast_fp16 = gelu(mode = input_69_mode_0, x = linear_16_cast_fp16)[name = tensor<string, []>("input_69_cast_fp16")];
            tensor<fp16, [384, 1536]> encoder_layer_2_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33696896)))];
            tensor<fp16, [384]> encoder_layer_2_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34876608)))];
            tensor<fp16, [1, 512, 384]> linear_17_cast_fp16 = linear(bias = encoder_layer_2_output_dense_bias_to_fp16, weight = encoder_layer_2_output_dense_weight_to_fp16, x = input_69_cast_fp16)[name = tensor<string, []>("linear_17_cast_fp16")];
            tensor<fp16, [1, 512, 384]> input_73_cast_fp16 = add(x = linear_17_cast_fp16, y = input_65_cast_fp16)[name = tensor<string, []>("input_73_cast_fp16")];
            tensor<int32, [1]> input_75_axes_0 = const()[name = tensor<string, []>("input_75_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> encoder_layer_2_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34877440)))];
            tensor<fp16, [384]> encoder_layer_2_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34878272)))];
            tensor<fp16, [1, 512, 384]> input_75_cast_fp16 = layer_norm(axes = input_75_axes_0, beta = encoder_layer_2_output_LayerNorm_bias_to_fp16, epsilon = var_301_to_fp16, gamma = encoder_layer_2_output_LayerNorm_weight_to_fp16, x = input_73_cast_fp16)[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<int32, []> var_386 = const()[name = tensor<string, []>("op_386"), val = tensor<int32, []>(-1)];
            tensor<fp16, [384, 384]> encoder_layer_3_attention_self_query_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_3_attention_self_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34879104)))];
            tensor<fp16, [384]> encoder_layer_3_attention_self_query_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_3_attention_self_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35174080)))];
            tensor<fp16, [1, 512, 384]> linear_18_cast_fp16 = linear(bias = encoder_layer_3_attention_self_query_bias_to_fp16, weight = encoder_layer_3_attention_self_query_weight_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("linear_18_cast_fp16")];
            tensor<fp16, [384, 384]> encoder_layer_3_attention_self_key_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_3_attention_self_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35174912)))];
            tensor<fp16, [384]> encoder_layer_3_attention_self_key_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_3_attention_self_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35469888)))];
            tensor<fp16, [1, 512, 384]> linear_19_cast_fp16 = linear(bias = encoder_layer_3_attention_self_key_bias_to_fp16, weight = encoder_layer_3_attention_self_key_weight_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("linear_19_cast_fp16")];
            tensor<int32, [4]> var_411 = const()[name = tensor<string, []>("op_411"), val = tensor<int32, [4]>([1, 512, 12, 32])];
            tensor<fp16, [1, 512, 12, 32]> x_39_cast_fp16 = reshape(shape = var_411, x = linear_19_cast_fp16)[name = tensor<string, []>("x_39_cast_fp16")];
            tensor<fp16, [384, 384]> encoder_layer_3_attention_self_value_weight_to_fp16 = const()[name = tensor<string, []>("encoder_layer_3_attention_self_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35470720)))];
            tensor<fp16, [384]> encoder_layer_3_attention_self_value_bias_to_fp16 = const()[name = tensor<string, []>("encoder_layer_3_attention_self_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35765696)))];
            tensor<fp16, [1, 512, 384]> linear_20_cast_fp16 = linear(bias = encoder_layer_3_attention_self_value_bias_to_fp16, weight = encoder_layer_3_attention_self_value_weight_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("linear_20_cast_fp16")];
            tensor<int32, [4]> var_420 = const()[name = tensor<string, []>("op_420"), val = tensor<int32, [4]>([1, 512, 12, 32])];
            tensor<fp16, [1, 512, 12, 32]> x_43_cast_fp16 = reshape(shape = var_420, x = linear_20_cast_fp16)[name = tensor<string, []>("x_43_cast_fp16")];
            tensor<int32, [4]> var_422 = const()[name = tensor<string, []>("op_422"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_426 = const()[name = tensor<string, []>("op_426"), val = tensor<int32, [4]>([1, 512, 12, 32])];
            tensor<fp16, [1, 512, 12, 32]> x_47_cast_fp16 = reshape(shape = var_426, x = linear_18_cast_fp16)[name = tensor<string, []>("x_47_cast_fp16")];
            tensor<bool, []> attention_scores_13_transpose_x_0 = const()[name = tensor<string, []>("attention_scores_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attention_scores_13_transpose_y_0 = const()[name = tensor<string, []>("attention_scores_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_42_perm_0 = const()[name = tensor<string, []>("transpose_42_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_43_perm_0 = const()[name = tensor<string, []>("transpose_43_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 12, 32, 512]> transpose_43 = transpose(perm = transpose_43_perm_0, x = x_39_cast_fp16)[name = tensor<string, []>("transpose_93")];
            tensor<fp16, [1, 12, 512, 32]> transpose_42 = transpose(perm = transpose_42_perm_0, x = x_47_cast_fp16)[name = tensor<string, []>("transpose_94")];
            tensor<fp16, [1, 12, 512, 512]> attention_scores_13_cast_fp16 = matmul(transpose_x = attention_scores_13_transpose_x_0, transpose_y = attention_scores_13_transpose_y_0, x = transpose_42, y = transpose_43)[name = tensor<string, []>("attention_scores_13_cast_fp16")];
            tensor<fp16, []> _inversed_attention_scores_15_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_attention_scores_15_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [1, 12, 512, 512]> _inversed_attention_scores_15_cast_fp16 = mul(x = attention_scores_13_cast_fp16, y = _inversed_attention_scores_15_y_0_to_fp16)[name = tensor<string, []>("_inversed_attention_scores_15_cast_fp16")];
            tensor<fp16, [1, 12, 512, 512]> input_77_cast_fp16 = add(x = _inversed_attention_scores_15_cast_fp16, y = attention_mask_cast_fp16)[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<fp16, [1, 12, 512, 512]> input_79_cast_fp16 = softmax(axis = var_386, x = input_77_cast_fp16)[name = tensor<string, []>("input_79_cast_fp16")];
            tensor<bool, []> context_layer_13_transpose_x_0 = const()[name = tensor<string, []>("context_layer_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> context_layer_13_transpose_y_0 = const()[name = tensor<string, []>("context_layer_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 512, 32]> value_layer_7_cast_fp16 = transpose(perm = var_422, x = x_43_cast_fp16)[name = tensor<string, []>("transpose_95")];
            tensor<fp16, [1, 12, 512, 32]> context_layer_13_cast_fp16 = matmul(transpose_x = context_layer_13_transpose_x_0, transpose_y = context_layer_13_transpose_y_0, x = input_79_cast_fp16, y = value_layer_7_cast_fp16)[name = tensor<string, []>("context_layer_13_cast_fp16")];
            tensor<int32, [4]> var_438 = const()[name = tensor<string, []>("op_438"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_443 = const()[name = tensor<string, []>("op_443"), val = tensor<int32, [3]>([1, 512, 384])];
            tensor<fp16, [1, 512, 12, 32]> var_439_cast_fp16 = transpose(perm = var_438, x = context_layer_13_cast_fp16)[name = tensor<string, []>("transpose_92")];
            tensor<fp16, [1, 512, 384]> input_81_cast_fp16 = reshape(shape = var_443, x = var_439_cast_fp16)[name = tensor<string, []>("input_81_cast_fp16")];
